; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=9, locations=11, density=1.0, fully_connected=True, max_capacity=2, out_folder=./full/training, instance_id=55, seed=96

(define (problem transport-55)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at p2 l6)
    (at p3 l1)
    (at p4 l1)
    (at p5 l3)
    (at p6 l7)
    (at p7 l11)
    (at p8 l6)
    (at p9 l2)
    (at v1 l5)
    (at v2 l6)
    (at v3 l6)
    (at v4 l5)
    )
 (:goal  (and 
    (at p1 l3)
    (at p2 l9)
    (at p3 l10)
    (at p4 l8)
    (at p5 l9)
    (at p6 l8)
    (at p7 l8)
    (at p8 l4)
    (at p9 l6))))

; plan
1. (drive v4 l5 l7)
   deleted: (at v4 l5)
   added: (at v4 l7)
   goals met: 0 of 9
2. (drive v3 l6 l2)
   deleted: (at v3 l6)
   added: (at v3 l2)
   goals met: 0 of 9
3. (pick-up v3 l2 p9 c1 c2)
   deleted: (at p9 l2) (capacity v3 c2)
   added: (in p9 v3) (capacity v3 c1)
   goals met: 0 of 9
4. (pick-up v3 l2 p1 c0 c1)
   deleted: (at p1 l2) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 0 of 9
5. (drive v3 l2 l3)
   deleted: (at v3 l2)
   added: (at v3 l3)
   goals met: 0 of 9
6. (drop v3 l3 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l3) (capacity v3 c1)
   goals met: 1 of 9
7. (pick-up v3 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 1 of 9
8. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 1 of 9
9. (drop v3 l6 p9 c0 c1)
   deleted: (in p9 v3) (capacity v3 c0)
   added: (at p9 l6) (capacity v3 c1)
   goals met: 2 of 9
10. (pick-up v2 l6 p8 c1 c2)
   deleted: (at p8 l6) (capacity v2 c2)
   added: (in p8 v2) (capacity v2 c1)
   goals met: 2 of 9
11. (drive v2 l6 l4)
   deleted: (at v2 l6)
   added: (at v2 l4)
   goals met: 2 of 9
12. (drop v2 l4 p8 c1 c2)
   deleted: (in p8 v2) (capacity v2 c1)
   added: (at p8 l4) (capacity v2 c2)
   goals met: 3 of 9
13. (pick-up v3 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 3 of 9
14. (drive v3 l6 l9)
   deleted: (at v3 l6)
   added: (at v3 l9)
   goals met: 3 of 9
15. (drop v3 l9 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l9) (capacity v3 c1)
   goals met: 4 of 9
16. (drop v3 l9 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l9) (capacity v3 c2)
   goals met: 5 of 9
17. (drive v2 l4 l1)
   deleted: (at v2 l4)
   added: (at v2 l1)
   goals met: 5 of 9
18. (pick-up v2 l1 p3 c1 c2)
   deleted: (at p3 l1) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 5 of 9
19. (pick-up v2 l1 p4 c0 c1)
   deleted: (at p4 l1) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 5 of 9
20. (drive v2 l1 l10)
   deleted: (at v2 l1)
   added: (at v2 l10)
   goals met: 5 of 9
21. (drop v2 l10 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l10) (capacity v2 c1)
   goals met: 6 of 9
22. (drive v2 l10 l11)
   deleted: (at v2 l10)
   added: (at v2 l11)
   goals met: 6 of 9
23. (pick-up v2 l11 p7 c0 c1)
   deleted: (at p7 l11) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 6 of 9
24. (drive v2 l11 l8)
   deleted: (at v2 l11)
   added: (at v2 l8)
   goals met: 6 of 9
25. (drop v2 l8 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l8) (capacity v2 c1)
   goals met: 7 of 9
26. (drop v2 l8 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l8) (capacity v2 c2)
   goals met: 8 of 9
27. (pick-up v4 l7 p6 c0 c1)
   deleted: (at p6 l7) (capacity v4 c1)
   added: (in p6 v4) (capacity v4 c0)
   goals met: 8 of 9
28. (drive v4 l7 l8)
   deleted: (at v4 l7)
   added: (at v4 l8)
   goals met: 8 of 9
29. (drop v4 l8 p6 c0 c1)
   deleted: (in p6 v4) (capacity v4 c0)
   added: (at p6 l8) (capacity v4 c1)
   goals met: 9 of 9
